[
  {
    "id": 1,
    "title": "The Science of Interstellar",
    "synopsis": "A journey through the otherworldly science behind Christopher Nolan’s highly anticipated film, Interstellar, from executive producer and theoretical physicist Kip Thorne. Interstellar, from acclaimed filmmaker Christopher Nolan, takes us on a fantastic voyage far beyond our solar system. Yet in The Science of Interstellar, Kip Thorne, the physicist who assisted Nolan on the scientific aspects of Interstellar, shows us that the movie’s jaw-dropping events and stunning, never-before-attempted visuals are grounded in real science. Thorne shares his experiences working as the science adviser on the film and then moves on to the science itself.",
    "author": "Kip Thorne, Christopher Nolan",
    "category": "Cosmology",
    "publisher": "W. W. Norton & Company",
    "published": "November 7, 2014",
    "language": "English",
    "rating": 4.7,
    "pages": 365,
    "poster": "https://api-devify.my.id/img/books/poster/1.jpg"
  },
  {
    "id": 2,
    "title": "Atomic Habits",
    "synopsis": "No matter your goals, Atomic Habits offers a proven framework for improving–every day. James Clear, one of the world’s leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results. If you’re having trouble changing your habits, the problem isn’t you. The problem is your system. Bad habits repeat themselves again and again not because you don’t want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you’ll get a proven system that can take you to new heights.",
    "author": "James Clear",
    "category": "Psychology",
    "publisher": "Penguin Random House",
    "published": "October 16, 2018",
    "language": "English",
    "rating": 4.8,
    "pages": 320,
    "poster": "https://api-devify.my.id/img/books/poster/2.jpg"
  },
  {
    "id": 3,
    "title": "The Psychology Of Money",
    "synopsis": "The Psychology of Money is a book written by Morgan Housel, a well-known financial writer and analyst. The book explores the complex relationship between psychology and human behavior regarding money and investing. Morgan Housel presents profound insights through stories, case studies, and unique financial perspectives. He delves into how emotions, beliefs, and mindsets can influence our financial decisions, providing valuable insights into overcoming common psychological traps in personal finance management.",
    "author": "Morgan Housel",
    "category": "Finance",
    "publisher": "Harriman House",
    "published": "January 1, 2020",
    "language": "English",
    "rating": 4.5,
    "pages": 256,
    "poster": "https://api-devify.my.id/img/books/poster/3.jpg"
  },
  {
    "id": 4,
    "title": "The 48 Laws of Power",
    "synopsis": "The 48 Laws of Power is a book written by Robert Greene. It serves as a guide to power, manipulation, and the strategies used by influential figures throughout history. In the book, Greene outlines 48 laws of power, illustrated with examples from historical figures, literature, and the business world. Readers are encouraged to understand the dynamics of power and how to apply these laws to achieve personal or professional goals. The book challenges readers to think critically about ethics and the impact of power in their lives.",
    "author": "Robert Greene",
    "category": "Psychology",
    "publisher": "Viking",
    "published": "September 1, 1998",
    "language": "English",
    "rating": 4.7,
    "pages": 452,
    "poster": "https://api-devify.my.id/img/books/poster/4.jpg"
  },
  {
    "id": 5,
    "title": "A Brief History of Time",
    "synopsis": "A Brief History of Time is a book written by renowned physicist Stephen Hawking. In this groundbreaking work, Hawking presents complex scientific concepts in a way that is accessible to the general public. The book explores the nature of the universe, the Big Bang theory, black holes, and the fundamental laws of physics. Hawking takes readers on a journey through the history of time, from the earliest moments of the universe's existence to the present day.",
    "author": "Stephen Hawking",
    "category": "Science",
    "publisher": "Bantam Books",
    "published": "September 1, 1988",
    "language": "English",
    "rating": 4.8,
    "pages": 256,
    "poster": "https://api-devify.my.id/img/books/poster/5.jpg"
  },
  {
    "id": 6,
    "title": "Harry Potter and the Sorcerer's Stone",
    "synopsis": "J.K. Rowling's enchanting tale begins with Harry Potter and the Sorcerer's Stone, the first book in the beloved Harry Potter series. The story follows young wizard Harry Potter as he discovers his magical heritage and embarks on an extraordinary journey at Hogwarts School of Witchcraft and Wizardry. Alongside his friends Ron and Hermione, Harry navigates the wonders and dangers of the wizarding world, culminating in a battle against the dark wizard Voldemort. The Sorcerer's Stone introduces readers to a magical realm of adventure, friendship, and the triumph of good over evil.",
    "author": "J.K. Rowling",
    "category": "Fiction",
    "publisher": "Bloomsbury",
    "published": "June 26, 1997",
    "language": "English",
    "rating": 4.4,
    "pages": 336,
    "poster": "https://api-devify.my.id/img/books/poster/6.jpg"
  },
  {
    "id": 7,
    "title": "The Da Vinci Code",
    "synopsis": "Dan Brown's gripping thriller, The Da Vinci Code, follows symbologist Robert Langdon and cryptologist Sophie Neveu as they unravel a religious mystery that could shake the foundations of Christianity. Racing against time and pursued by mysterious adversaries, Langdon and Neveu decipher clues hidden in art and history, leading them to uncover secrets that have been guarded for centuries. As they delve deeper into the enigma of the Holy Grail, they must confront ancient conspiracies and face their own beliefs and loyalties.",
    "author": "Dan Brown",
    "category": "Fiction",
    "publisher": "Doubleday",
    "published": "March 18, 2003",
    "language": "English",
    "rating": 3.8,
    "pages": 454,
    "poster": "https://api-devify.my.id/img/books/poster/7.jpg"
  },
  {
    "id": 8,
    "title": "The Catcher in the Rye",
    "synopsis": "J.D. Salinger's iconic novel, The Catcher in the Rye, follows the disenchanted teenager Holden Caulfield as he embarks on a soul-searching journey through New York City. The novel captures the spirit of adolescence, depicting Holden's struggles with identity, alienation, and society's phoniness. With its unique voice and candid exploration of teenage angst, The Catcher in the Rye continues to resonate with readers of all ages, becoming a literary classic that stands the test of time.",
    "author": "J.D. Salinger",
    "category": "Fiction",
    "publisher": "Little, Brown and Company",
    "published": "July 16, 1951",
    "language": "English",
    "rating": 3.8,
    "pages": 277,
    "poster": "https://api-devify.my.id/img/books/poster/8.jpg"
  },
  {
    "id": 9,
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "synopsis": "J.R.R. Tolkien's epic fantasy masterpiece begins with The Fellowship of the Ring, the first volume of The Lord of the Rings trilogy. The story follows Frodo Baggins, a humble hobbit, who embarks on a perilous quest to destroy the One Ring and prevent the dark lord Sauron from reclaiming power. Accompanied by a diverse fellowship, Frodo's journey takes him through fantastical landscapes, battles, and encounters with mythical creatures. Tolkien's richly imagined world and captivating narrative have solidified The Fellowship of the Ring as a monumental work of fantasy literature.",
    "author": "J.R.R. Tolkien",
    "category": "Fiction",
    "publisher": "Allen & Unwin",
    "published": "July 29, 1954",
    "language": "English",
    "rating": 4.3,
    "pages": 398,
    "poster": "https://api-devify.my.id/img/books/poster/9.jpg"
  },
  {
    "id": 10,
    "title": "The Power of Habit: Why We Do What We Do in Life and Business",
    "synopsis": "In The Power of Habit, Charles Duhigg explores the science of habits and their profound impact on personal and organizational behavior. Drawing on research from neuroscience and psychology, Duhigg delves into the formation, transformation, and influence of habits in daily life. He presents compelling case studies and real-life examples to illustrate how habits can be understood, modified, and leveraged for personal and professional success. A thought-provoking and practical guide, The Power of Habit offers valuable insights into understanding the mechanisms that govern our actions and choices.",
    "author": "Charles Duhigg",
    "category": "Psychology",
    "publisher": "Random House",
    "published": "February 28, 2012",
    "language": "English",
    "rating": 4.1,
    "pages": 371,
    "poster": "https://api-devify.my.id/img/books/poster/10.jpg"
  },
  {
    "id": 11,
    "title": "The Alchemist",
    "synopsis": "The Alchemist by Paulo Coelho is a captivating philosophical novel that follows Santiago, a young Andalusian shepherd, on a transformative journey in search of a hidden treasure. Along the way, Santiago encounters various characters who impart valuable life lessons about following one's dreams and embracing the language of the universe. This enchanting tale of self-discovery, destiny, and the pursuit of one's Personal Legend resonates with readers worldwide and has become a timeless masterpiece that celebrates the power of hope and the courage to chase our dreams.",
    "author": "Paulo Coelho",
    "category": "Fiction",
    "publisher": "HarperOne",
    "published": "April 25, 1993",
    "language": "English",
    "rating": 3.8,
    "pages": 208,
    "poster": "https://api-devify.my.id/img/books/poster/11.jpg"
  },
  {
    "id": 12,
    "title": "The Hobbit",
    "synopsis": "J.R.R. Tolkien's classic fantasy novel, The Hobbit, takes readers on a grand adventure through Middle-earth. Bilbo Baggins, a hobbit content with a quiet life, is thrust into an unexpected quest by the wizard Gandalf. Accompanied by a group of dwarves, Bilbo embarks on a journey to reclaim the Lonely Mountain and its treasure from the fearsome dragon, Smaug. Along the way, he faces various perils, discovers hidden strengths, and forges unexpected friendships. The Hobbit is a timeless tale of bravery, heroism, and the indomitable spirit of ordinary individuals.",
    "author": "J.R.R. Tolkien",
    "category": "Fiction",
    "publisher": "Allen & Unwin",
    "published": "September 21, 1937",
    "language": "English",
    "rating": 4.2,
    "pages": 310,
    "poster": "https://api-devify.my.id/img/books/poster/12.jpg"
  },
  {
    "id": 13,
    "title": "The Book Thief",
    "synopsis": "Set in Nazi Germany during World War II, The Book Thief by Markus Zusak tells the remarkable story of Liesel Meminger, a young girl whose life is transformed by the power of words. Amidst the devastation of war, Liesel discovers solace in stealing books and sharing them with others, even as she confronts the harsh realities of prejudice and loss. Narrated by Death, the novel offers a poignant and unique perspective on the resilience of the human spirit and the importance of literature in challenging times.",
    "author": "Markus Zusak",
    "category": "Fiction",
    "publisher": "Allen & Unwin",
    "published": "March 1, 2006",
    "language": "English",
    "rating": 4.3,
    "pages": 310,
    "poster": "https://api-devify.my.id/img/books/poster/13.jpg"
  },
  {
    "id": 14,
    "title": "The Giver",
    "synopsis": "Lois Lowry's award-winning novel, The Giver, presents a seemingly utopian society where pain and suffering have been eradicated. In this community, Jonas is assigned the unique role of the Receiver of Memory, responsible for holding the collective memories of humanity. As Jonas gains awareness of the society's dark secrets and limitations on individuality, he is faced with a choice that will change his life and the destiny of his world. The Giver is a thought-provoking exploration of the human experience, memory, and the consequences of suppressing emotions.",
    "author": "Lois Lowry",
    "category": "Fiction",
    "publisher": "Houghton Mifflin",
    "published": "April 26, 1993",
    "language": "English",
    "rating": 4.1,
    "pages": 208,
    "poster": "https://api-devify.my.id/img/books/poster/14.jpg"
  },
  {
    "id": 15,
    "title": "The Kite Runner",
    "synopsis": "Khaled Hosseini's powerful novel, The Kite Runner, follows the lives of Amir and Hassan, two childhood friends from different social classes in Afghanistan. Set against the backdrop of political turmoil and social upheaval, the story explores themes of guilt, redemption, and the enduring bond between friends. As the narrative spans decades and continents, The Kite Runner offers a poignant and emotional journey of love, sacrifice, and the search for forgiveness.",
    "author": "Khaled Hosseini",
    "category": "Fiction",
    "publisher": "Khaled Hosseini",
    "published": "May 29, 2003",
    "language": "English",
    "rating": 4.3,
    "pages": 371,
    "poster": "https://api-devify.my.id/img/books/poster/15.jpg"
  },
  {
    "id": 16,
    "title": "Astrophysics for People in a Hurry.",
    "synopsis": "Khaled Hosseini's powerful novel, The Kite Runner, follows the lives of Amir and Hassan, two childhood friends from different social classes in Afghanistan. Set against the backdrop of political turmoil and social upheaval, the story explores themes of guilt, redemption, and the enduring bond between friends. As the narrative spans decades and continents, The Kite Runner offers a poignant and emotional journey of love, sacrifice, and the search for forgiveness.",
    "author": "Neil deGrasse Tyson",
    "category": "Non-fiction",
    "publisher": "W. W. Norton & Company",
    "published": "May 2, 2017",
    "language": "English",
    "rating": 4.6,
    "pages": 244,
    "poster": "https://api-devify.my.id/img/books/poster/16.jpg"
  },
  {
    "id": 17,
    "title": "Sapiens: A Brief History of Humankind",
    "synopsis": "Yuval Noah Harari's Sapiens: A Brief History of Humankind is a captivating journey through time, offering readers an unprecedented understanding of the forces that have shaped our species and the world we inhabit. Harari's unique blend of historical analysis and visionary thinking provides a compelling perspective on the human story, prompting us to contemplate our place in the vast expanse of history and the potential paths that lie ahead. Whether you're a history enthusiast or a curious explorer, Sapiens offers an enlightening and thought-provoking exploration of the past and a glimpse into the potential future of Homo sapiens.",
    "author": "Yuval Noah Harari",
    "category": "History",
    "publisher": "Harper",
    "published": "February 10, 2015",
    "language": "English",
    "rating": 4.4,
    "pages": 443,
    "poster": "https://api-devify.my.id/img/books/poster/17.jpg"
  },
  {
    "id": 18,
    "title": "The Diary of a Young Girl",
    "synopsis": "The Diary of a Young Girl by Anne Frank is a poignant and deeply moving account of a young Jewish girl's life during the Holocaust. Set against the backdrop of World War II, this diary is a powerful testament to the strength of the human spirit and the enduring hope in the face of unimaginable adversity. Anne Frank, a thirteen-year-old Jewish girl, began writing her diary on June 12, 1942, while in hiding with her family in Amsterdam to escape Nazi persecution. As she chronicles her daily experiences and innermost thoughts, the diary becomes a profound record of the challenges and emotions she faced during the two years spent in hiding.",
    "author": "Anne Frank",
    "category": "Non-Fiction",
    "publisher": "Bantam Books",
    "published": "June 25, 1947",
    "language": "English",
    "rating": 4.1,
    "pages": 352,
    "poster": "https://api-devify.my.id/img/books/poster/18.jpg"
  },
  {
    "id": 19,
    "title": "Gone Girl",
    "synopsis": "Gone Girl by Gillian Flynn is a riveting and dark exploration of the human psyche, a psychological thriller that challenges perceptions and keeps readers guessing until the shocking conclusion. With its skillful character development, intricate plot twists, and razor-sharp prose, the novel has garnered critical acclaim and a wide readership. As Gillian Flynn crafts a chilling narrative of love, betrayal, and deceit, Gone Girl remains a gripping and unforgettable journey into the depths of human manipulation and the consequences of hidden truths.",
    "author": "Gillian Flynn",
    "category": "Fiction",
    "publisher": "Crown Publishing Group",
    "published": "June 5, 2012",
    "language": "English",
    "rating": 4.0,
    "pages": 432,
    "poster": "https://api-devify.my.id/img/books/poster/19.jpg"
  },
  {
    "id": 20,
    "title": "The Night Circus",
    "synopsis": "The Night Circus by Erin Morgenstern is a spellbinding tale of enchantment and wonder set within the mysterious confines of Le Cirque des Rêves, a circus that appears only at night. Behind the magical facade, a fierce competition unfolds between two young magicians, Celia Bowen and Marco Alisdair, who have been bound into a duel of skills and imagination by their respective mentors. As the circus travels from city to city, its ethereal tents hold a wondrous array of breathtaking performances and attractions, each more extraordinary than the last. Unbeknownst to the enchanted audience, this enchanted playground serves as the battleground for Celia and Marco's boundless creativity, with each tent a stage for their awe-inspiring displays of magic.",
    "author": "Erin Morgenstern",
    "category": "Fiction",
    "publisher": "Doubleday",
    "published": "September 13, 2011",
    "language": "English",
    "rating": 4.0,
    "pages": 400,
    "poster": "https://api-devify.my.id/img/books/poster/20.jpg"
  }
]
